src/СРМ/src/Documents/ОтчетПоРаботамПартнеру/ОтчетПоРаботамПартнеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПоРаботамПартнеру</name>
  <registerRecords>AccumulationRegister.ВысталенныеЗадачи</registerRecords>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыФормированияЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Задачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.RA_RedmineЗадачи</types>
        <types>DocumentRef.Задача</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплатыЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактОбращения</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/Documents/ОтчетПоРаботамПартнеру/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Отчет по работам
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ОтчетПоРаботамПартнеру";
	КомандаПечати.Идентификатор = "ОтчетПоРаботе";
	КомандаПечати.Представление = НСтр("ru = 'Отчет по работе'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
   ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ОтчетПоРаботе");
    Если ПечатнаяФорма <> Неопределено Тогда
        ПечатнаяФорма.ТабличныйДокумент = ПечатьОтчетаПоРаботе(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Отчет по работе'");
		//ПечатнаяФорма.ПолныйПутьКМакету = "Документ._ДемоСчетНаОплатуПокупателю.ПФ_MXL_СчетЗаказ";
	КонецЕсли;
КонецПроцедуры

Функция ПечатьОтчетаПоРаботе(МассивОбъектов, ОбъектыПечати)
    // Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ОтчетПоРаботе";
	
	Макет=Документы.ОтчетПоРаботамПартнеру.ПолучитьМакет("ОтчетПоРаботе");
	
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ФормированиеЗаказа.Ссылка КАК Ссылка,
	|	ФормированиеЗаказа.ВерсияДанных КАК ВерсияДанных,
	|	ФормированиеЗаказа.ПометкаУдаления КАК ПометкаУдаления,
	|	ФормированиеЗаказа.Номер КАК Номер,
	|	ФормированиеЗаказа.Дата КАК Дата,
	|	ФормированиеЗаказа.Проведен КАК Проведен,
	|	ФормированиеЗаказа.Партнер КАК Партнер,
	|	ФормированиеЗаказа.ПериодРегистрации КАК ПериодРегистрации,
	|	ФормированиеЗаказа.Статус КАК Статус,
	|	ФормированиеЗаказа.Ответственный КАК Ответственный,
	|	ФормированиеЗаказа.Комментарий КАК Комментарий,
	|	ФормированиеЗаказа.Задачи.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Задача КАК Задача,
	|		Исполнитель КАК Исполнитель,
	|		КоличествоЧасов КАК КоличествоЧасов,
	|		ВидОплаты КАК ВидОплаты
	|	) КАК Задачи
	|ИЗ
	|	Документ.ОтчетПоРаботамПартнеру КАК ФормированиеЗаказа
	|ГДЕ
	|	ФормированиеЗаказа.Ссылка В(&МассивОбъектов)";
    
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Шапка.Следующий() Цикл
	    Если Не ПервыйДокумент Тогда
	        // Все документы нужно выводить на разных страницах.
	        ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	    КонецЕсли;
	    ПервыйДокумент = Ложь;
	    // Запомним номер строки, с которой начали выводить текущий документ.
	    НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	    
		ОбластьЗаголовок=Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.ТекстЗаголовка=СтрШаблон(НСтр("ru = '%1 № %2 от %3'"),"Отчет по работам", Шапка.Номер, Формат(Шапка.Дата, "ДЛФ=DD"));
		ОбластьЗаголовок.Параметры.МесяцРабот=Шапка.ПериодРегистрации;
		ОбластьЗаголовок.Параметры.Заказчик=Шапка.Партнер;
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ТаблицаЗадач=Шапка.Задачи.Выгрузить();
		МассивВидовОплат=Новый Массив;
		Для Каждого Стр Из ТаблицаЗадач Цикл
			Если МассивВидовОплат.Найти(Стр.ВидОплаты)=Неопределено Тогда
				МассивВидовОплат.Добавить(Стр.ВидОплаты);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ВидОплаты ИЗ МассивВидовОплат Цикл
			ОбластьЗаголовок=Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ОбластьЗаголовок.Параметры.ЗаголовокТаблицы="Вид оплаты задачи: "+ВидОплаты;
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			ОбластьЗаголовок=Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			ИтогоЧасов=0;
			
			СтруктураОтбора=Новый Структура;
			СтруктураОтбора.Вставить("ВидОплаты", ВидОплаты);
			СтрокиЗадачПоВидуОплат=ТаблицаЗадач.НайтиСтроки(СтруктураОтбора);
			
			Для Каждого СтрокаТЗ ИЗ СтрокиЗадачПоВидуОплат Цикл
				ОбластьМакета=Макет.ПолучитьОбласть("Строка");
				Если ТипЗнч(СтрокаТЗ.Задача)=Тип("СправочникСсылка.RA_RedmineЗадачи") ТОгда
					ОбластьМакета.Параметры.НомерЗадачи=СтрокаТЗ.Задача.Код;
					ОбластьМакета.Параметры.Тема=СтрокаТЗ.Задача.Наименование;
				Иначе
					ОбластьМакета.Параметры.НомерЗадачи=СтрокаТЗ.Задача.Номер;
					ОбластьМакета.Параметры.Тема=СтрокаТЗ.Задача.Тема;
				КонецЕсли;
				ОбластьМакета.Параметры.КоличествоЧасов=СтрокаТЗ.КоличествоЧасов;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ИтогоЧасов=ИтогоЧасов+СтрокаТЗ.КоличествоЧасов;
			КонецЦикла;
			
			ОбластьИтого=Макет.ПолучитьОбласть("Итого");
			ОбластьИтого.Параметры.Всего=ИтогоЧасов;
			ТабличныйДокумент.Вывести(ОбластьИтого);
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	Возврат ТабличныйДокумент;
КонецФункции

#КонецОбласти
